DBCLabs/app/views/proposals/show.html.erb

SELECT "experiments".* FROM "experiments" WHERE "experiments"."proposal_id" = $1  [["proposal_id", 1]]
---

<% if @proposal.experiments.length > 0 %>