DBCLabs/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "{\"content\"=>\"erwrer\"}"], ["commentable_id", 2], ["commentable_type", "Proposal"], ["created_at", "2015-08-04 14:46:38.639995"], ["updated_at", "2015-08-04 14:46:38.639995"]]
---
def create
  @parent = Experiment.find(params[:experiment_id]) if params[:experiment_id]
  @parent = Comment.find(params[:comment_id]) if params[:comment_id]
  @comment = @parent.comments.new(params[:comment])
    if @comment.save