DBCLabs/app/controllers/experiments_controller.rb

  def index
      @proposals = Proposal.all
      @experiments = Experiment.all
---
SELECT "experiments".* FROM "experiments"  ORDER BY created_at DESC

    def show
      @proposal = Proposal.find(params[:proposal_id])
      @experiment = Experiment.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT 1  [["id", 3]]

    def new
      @experiment = Experiment.new
      @proposal = Proposal.find(params[:proposal_id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]

    def create
      @proposal = Proposal.find(params[:proposal_id])
      @experiment = @proposal.experiments.new(experiment_params)
      if @experiment.save
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "experiments" ("title", "materials", "procedures", "observations", "results", "conclusion", "proposal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"