DBCLabs/app/controllers/proposals_controller.rb

  def index
    @proposals = Proposal.all
    @experiments = Experiment.order("created_at DESC").limit(10)
---
SELECT "proposals".* FROM "proposals"
SELECT  "experiments".* FROM "experiments"  ORDER BY created_at DESC LIMIT 10

  def show
    @proposal = Proposal.find(params[:id])
    p @proposal
    @experiments = @proposal.experiments.all
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 0]]
SELECT "experiments".* FROM "experiments" WHERE "experiments"."proposal_id" = $1  [["proposal_id", 1]]

  def create
    user = User.find(session[:user_id])
    @proposal = Proposal.new(proposal_params)
    @proposal.proposer = user
    if @proposal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "proposals" ("title", "hypothesis", "summary", "proposer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test2"], ["hypothesis", "hey mama"], ["summary", "very hungry"], ["proposer_id", 1], ["created_at", "2015-08-03 23:55:18.373812"], ["updated_at", "2015-08-03 23:55:18.373812"]]