DBCLabs/app/controllers/sessions_controller.rb

    def find_user
      @user = User.find_by(name: params[:user][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "rr@wu.edu"]]