DBCLabs/app/controllers/users_controller.rb

  def show
    user = User.find(session[:user_id])
    puts "$$$$$$$$$$$$$$$$$$$$$$"
    @proposals = user.proposals.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 1]]